tutorials/basic/scalarTransportDBSFoam/4StraightFractures/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   inlet 
    {
        type            fixedValue;
	value           uniform PDROP;
    }

   outlet 
    {
        type            fixedValue;
        value           uniform 0;
    }

    walls 
    {
        type            zeroGradient;
    }

       frontAndBack
   {
           type empty;
   }



}


// ************************************************************************* //
